#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/private-henrique-percu/github-actions/runs/run-piTYPGSV9yMUsccw

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=ecsTaskExecutionRole-20230414125018834700000001]
aws_ecr_repository.demo_ecr: Refreshing state... [id=demo_ecs_repository]
data.aws_ecs_cluster.ecs_cluster: Refreshing...
data.aws_iam_role.ecs_task_execution_role: Refreshing...
data.aws_region.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
aws_ecs_cluster.demo_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster]
aws_iam_role.ecs_task_execution_iam_role: Refreshing state... [id=ecsTaskExecutionRole]
data.aws_region.current: Refresh complete after 0s [id=us-west-2]
data.aws_caller_identity.current: Refresh complete after 0s [id=689210545704]
data.aws_iam_role.ecs_task_execution_role: Refresh complete after 0s [id=ecsTaskExecutionRole]
data.aws_ecs_cluster.ecs_cluster: Refresh complete after 0s [id=arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster]
aws_iam_role.ecs_task_execution_iam_role: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.demo_ecr will be destroyed
  # (because aws_ecr_repository.demo_ecr is not in configuration)
  - resource "aws_ecr_repository" "demo_ecr" {
      - arn                  = "arn:aws:ecr:us-west-2:689210545704:repository/demo_ecs_repository" -> null
      - id                   = "demo_ecs_repository" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "demo_ecs_repository" -> null
      - registry_id          = "689210545704" -> null
      - repository_url       = "689210545704.dkr.ecr.us-west-2.amazonaws.com/demo_ecs_repository" -> null
      - tags                 = {
          - "Env"  = "demo"
          - "Name" = "demo_ecs_cluster"
        } -> null
      - tags_all             = {
          - "Env"  = "demo"
          - "Name" = "demo_ecs_cluster"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecs_cluster.demo_ecs_cluster will be destroyed
  # (because aws_ecs_cluster.demo_ecs_cluster is not in configuration)
  - resource "aws_ecs_cluster" "demo_ecs_cluster" {
      - arn                = "arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster" -> null
      - name               = "demo_ecs_cluster" -> null
      - tags               = {
          - "Env"  = "demo"
          - "Name" = "demo_ecs_cluster"
        } -> null
      - tags_all           = {
          - "Env"  = "demo"
          - "Name" = "demo_ecs_cluster"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "demo_containerized_app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false
    }

  # aws_ecs_task_definition.demo_container_application_task_definition will be created
  + resource "aws_ecs_task_definition" "demo_container_application_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 512
                  + image        = "689210545704.dkr.ecr.us-west-2.amazonaws.com/<<container_name>>:latest"
                  + memory       = 1024
                  + name         = "demo_ecs_repository"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::689210545704:role/ecsTaskExecutionRole"
      + family                   = "demo_container_application_family"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_iam_role will be destroyed
  # (because aws_iam_role.ecs_task_execution_iam_role is not in configuration)
  - resource "aws_iam_role" "ecs_task_execution_iam_role" {
      - arn                   = "arn:aws:iam::689210545704:role/ecsTaskExecutionRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-14T12:50:18Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecsTaskExecutionRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecsTaskExecutionRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA2A6BGKYUHMRMQ7HPR" -> null
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_role is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
      - id         = "ecsTaskExecutionRole-20230414125018834700000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "ecsTaskExecutionRole" -> null
    }

Plan: 2 to add, 0 to change, 4 to destroy.

```
</details>
*Pushed by: @HenriquePercu, Action: `pull_request`*